{"config": {"layers": [{"name": "face_left", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 32, 32], "name": "face_left", "dtype": "float32", "sparse": false}}, {"name": "face_right", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 32, 32], "name": "face_right", "dtype": "float32", "sparse": false}}, {"name": "model_1", "inbound_nodes": [[["face_left", 0, 0, {}]], [["face_right", 0, 0, {}]]], "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 1, 32, 32], "name": "input_1", "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "filters": 32, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.33000001311302185}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "filters": 32, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.33000001311302185}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"padding": "same", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "filters": 64, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "strides": [2, 2], "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.33000001311302185}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_4", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "filters": 64, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.33000001311302185}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"padding": "same", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_5", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "filters": 128, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "strides": [2, 2], "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "leaky_re_lu_5", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.33000001311302185}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_6", "config": {"padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_6", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "filters": 128, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "leaky_re_lu_6", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.33000001311302185}}, {"class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "dropout_1", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.25}}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "config": {"activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "units": 512, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"gamma_constraint": null, "scale": true, "name": "batch_normalization_1", "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "tanh"}}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["activation_1", 0, 0]]}}, {"name": "add_1", "inbound_nodes": [[["model_1", 1, 0, {}], ["model_1", 2, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_1"}}, {"name": "gaussian_noise_1", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_1", "trainable": true, "stddev": 0.5}}, {"name": "dropout_2", "inbound_nodes": [[["gaussian_noise_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.2}}, {"name": "dense_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "units": 256, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "activation": "linear"}}, {"name": "batch_normalization_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "scale": true, "name": "batch_normalization_2", "trainable": true, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}}, {"name": "leaky_re_lu_7", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.33000001311302185}}, {"name": "dropout_3", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.5}}, {"name": "dense_3", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "name": "dense_3", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 1, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "activation": "linear"}}, {"name": "activation_2", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "sigmoid"}}], "input_layers": [["face_left", 0, 0], ["face_right", 0, 0]], "name": "model_2", "output_layers": [["activation_2", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.9"}