{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "dtype": "float32", "activity_regularizer": null, "name": "image_array", "batch_input_shape": [null, 48, 48, 3], "bias_regularizer": null, "filters": 16, "data_format": "channels_last", "kernel_size": [7, 7], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "name": "conv2d_1", "activation": "linear", "bias_regularizer": null, "filters": 16, "data_format": "channels_last", "kernel_size": [7, 7], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "name": "average_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "name": "conv2d_2", "activation": "linear", "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "name": "conv2d_3", "activation": "linear", "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "name": "average_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "name": "dropout_2", "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "name": "conv2d_4", "activation": "linear", "bias_regularizer": null, "filters": 64, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "name": "conv2d_5", "activation": "linear", "bias_regularizer": null, "filters": 64, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "name": "average_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "name": "dropout_3", "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "name": "conv2d_6", "activation": "linear", "bias_regularizer": null, "filters": 128, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "name": "conv2d_7", "activation": "linear", "bias_regularizer": null, "filters": 128, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "name": "average_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "name": "dropout_4", "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "name": "conv2d_8", "activation": "linear", "bias_regularizer": null, "filters": 256, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "name": "conv2d_9", "activation": "linear", "bias_regularizer": null, "filters": 7, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true}}, {"class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "name": "global_average_pooling2d_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "predictions", "activation": "softmax", "trainable": true}}], "keras_version": "2.0.9"}