{"backend": "tensorflow", "config": {"input_layers": [["permute_1_input", 0, 0]], "output_layers": [["flatten_1", 0, 0]], "name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "permute_1_input"}, "name": "permute_1_input", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"trainable": true, "dims": [1, 2, 3], "dtype": "float32", "name": "permute_1", "batch_input_shape": [null, 224, 224, 3]}, "name": "permute_1", "class_name": "Permute", "inbound_nodes": [[["permute_1_input", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 64, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1_1", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv1_1", "class_name": "Conv2D", "inbound_nodes": [[["permute_1", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 64, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1_2", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv1_2", "class_name": "Conv2D", "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 128, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2_1", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv2_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 128, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2_2", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv2_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 256, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv3_1", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv3_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 256, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv3_2", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv3_2", "class_name": "Conv2D", "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 256, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv3_3", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv3_3", "class_name": "Conv2D", "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv4_1", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv4_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv4_2", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv4_2", "class_name": "Conv2D", "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv4_3", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv4_3", "class_name": "Conv2D", "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_4", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_4", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv5_1", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv5_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv5_2", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv5_2", "class_name": "Conv2D", "inbound_nodes": [[["conv5_1", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv5_3", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "conv5_3", "class_name": "Conv2D", "inbound_nodes": [[["conv5_2", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_5", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_5", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv5_3", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 4096, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "kernel_size": [7, 7], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "fc6", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "fc6", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_1", "noise_shape": null}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["fc6", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 4096, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "kernel_size": [1, 1], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "fc7", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "fc7", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_2", "noise_shape": null}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["fc7", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "filters": 2622, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "kernel_size": [1, 1], "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "fc8", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "name": "fc8", "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["fc8", 0, 0, {}]]]}]}, "keras_version": "2.0.9", "class_name": "Model"}