{"class_name": "Sequential", "keras_version": "2.0.9", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "name": "image_array", "data_format": "channels_last", "bias_constraint": null, "filters": 32, "kernel_size": [7, 7], "kernel_constraint": null, "batch_input_shape": [null, 48, 48, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "axis": -1, "center": true, "gamma_constraint": null, "name": "batch_normalization_1"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "filters": 32, "kernel_size": [7, 7], "kernel_constraint": null, "name": "conv2d_1"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "axis": -1, "center": true, "gamma_constraint": null, "name": "batch_normalization_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_1"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.5, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "filters": 64, "kernel_size": [5, 5], "kernel_constraint": null, "name": "conv2d_2"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "axis": -1, "center": true, "gamma_constraint": null, "name": "batch_normalization_3"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "filters": 64, "kernel_size": [5, 5], "kernel_constraint": null, "name": "conv2d_3"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "axis": -1, "center": true, "gamma_constraint": null, "name": "batch_normalization_4"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_2"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_2", "rate": 0.5, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "filters": 128, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_4"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "axis": -1, "center": true, "gamma_constraint": null, "name": "batch_normalization_5"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "filters": 128, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_5"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "axis": -1, "center": true, "gamma_constraint": null, "name": "batch_normalization_6"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_3"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_3", "rate": 0.5, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "filters": 256, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_6"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "axis": -1, "center": true, "gamma_constraint": null, "name": "batch_normalization_7"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "filters": 256, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_7"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "axis": -1, "center": true, "gamma_constraint": null, "name": "batch_normalization_8"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_4"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_4", "rate": 0.5, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "filters": 512, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_8"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "axis": -1, "center": true, "gamma_constraint": null, "name": "batch_normalization_9"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "filters": 7, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_9"}}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "predictions", "activation": "softmax"}}], "backend": "tensorflow"}