{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "name": "image_array", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "activation": "linear", "batch_input_shape": [null, 48, 48, 1], "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "name": "batch_normalization_1", "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_1", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "name": "batch_normalization_2", "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_2", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "name": "batch_normalization_3", "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_3", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "name": "batch_normalization_4", "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_size": [3, 3], "activation": "linear", "name": "conv2d_4", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "name": "batch_normalization_5", "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_size": [3, 3], "activation": "linear", "name": "conv2d_5", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "name": "batch_normalization_6", "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_3", "seed": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_size": [1, 1], "activation": "linear", "name": "conv2d_6", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "name": "batch_normalization_7", "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_size": [3, 3], "activation": "linear", "name": "conv2d_7", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "name": "batch_normalization_8", "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_4", "seed": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "kernel_size": [1, 1], "activation": "linear", "name": "conv2d_8", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "name": "batch_normalization_9", "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_size": [3, 3], "activation": "linear", "name": "conv2d_9", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "kernel_size": [1, 1], "activation": "linear", "name": "conv2d_10", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "name": "batch_normalization_10", "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 7, "kernel_size": [3, 3], "activation": "linear", "name": "conv2d_11", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "predictions"}}], "keras_version": "2.0.9"}