{"class_name": "Sequential", "keras_version": "2.0.9", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "image_array", "dtype": "float32", "batch_input_shape": [null, 48, 48, 1], "kernel_constraint": null, "filters": 16, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "kernel_size": [5, 5], "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "kernel_size": [5, 5], "filters": 16, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "kernel_size": [5, 5], "filters": 32, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "kernel_size": [5, 5], "filters": 32, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "kernel_size": [3, 3], "filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "kernel_size": [3, 3], "filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_3", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "kernel_size": [1, 1], "filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "kernel_size": [3, 3], "filters": 128, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_4", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "kernel_size": [1, 1], "filters": 256, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "kernel_size": [3, 3], "filters": 128, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_10", "kernel_size": [1, 1], "filters": 256, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "kernel_size": [3, 3], "filters": 7, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "predictions", "trainable": true, "activation": "softmax"}}]}